{
  "course_id": "32905",
  "course_name": "2IRR20 (2025-1) Networks",
  "course_code": "2IRR20 Networks",
  "workflow_state": "available",
  "homepage": {
    "title": "Homepage",
    "body": "Welcome to Networks (2IRR20)\n\nThe course is organized as an introduction into networks. A (computer) network is a facilitator of distributed applications. We will discuss why we need networks, how networks function and what the main issues are. The course offers a dual approach: theoretical exploration network theory, involving study and reporting on contemporary literature; and practical application through hands-on lab sessions, providing tangible experience. It has a mandatory textbook (see below).\n\nSCHEDULE ➔\n\nASSIGNMENTS ➔\nESSAY ➔\nFAQ ➔\nSTUDY GUIDE ➔\n\n! Important\n\nFraud and copyright infringements are forbidden. Incidents caught will be handed off to the examination committee at once. Please note that this is not just limited to copying from peers! Please read here the details about what fraud and copyright infringement entail. \n\nLearning goals\n\nThe learning objectives are: \n\n• understanding the organization of computer networks, including heterogeneous networks of networks such as the Internet, or the Internet of Things\n\n• understanding the Internet structure and how standard problems are solved in that context, \n\n• being able to analyze simple network protocols, \n\n• being able to independently study literature concerning computer networks.\n\nForms of education\n\nThe course consists of regular lectures, instructions and lab sessions. See the study guide to find out more about the course organization.\n\nAssessment\n\nThe assessment is through\n\n• Final examination including lab question(s) - 60% of the final result\n\n• A sample exam is now available. Note that the exam will contain questions about the work done during lab sessions.\n\n• Weekly homework exercises (4 of them) - 20% of the final result\n\n• Final essay - 20% of the final result\n\n• More details and a sample essay can be found here.\n\nLab exercises\n\nThese exercises (output of lab sessions) will not be graded. However, you may expect some questions about lab sessions in the exam. The lab assignments will be published on the day of the corresponding lab class.\n\nWeekly homework assignments\n\nA selection of 2 exercises in each homework set will be graded. However, we won't tell you in advance which exact exercises will be graded. When computing the final homework average we will discard the worst assignment score of the student. See slide set 00 for details. \n\nFinal Essay (professional skills part of the course)\n\nThe details of writing and submitting the essay are on this page. After submitting your essay as one group of three students, each student in the essay group must fill in the peer assessment form. This will be used for identifying free-riders and for differentiating among group members who did not contribute equally. Therefore, not all members of the essay group will necessarily get the same grade. Free-riding results in getting zero from the essay. There can be a maximum of 3 points (out of 10) difference between any two group members based on the peer review; i.e. other than in case of free-riding as noted above. See slide set 00 for details. If there is a free-rider in your group you should notify the teacher as soon as possible (i.e., do not wait until it is very late to solve this for you.)\n\nTextbook (mandatory)\n\nComputer Networking: A Top-Down Approach, Global Edition, 8th edition\n\nby James Kurose, Keith Ross.\n\nISBN: 9781292405469 \n\nIf you prefer, you can buy the digital copy instead. This is available at the publisher's website (as well as on other online e-commerce websites). The digital version at the publisher's website seems to be more affordable than their price of the physical copy, but you have access to reading the book only for a certain number of months, depending on which version you buy. Online reading seems to be possible from any computer on a web browser. However, offline reading seems to be possible only on the Pearson+ app. This means that if you only have a laptop (and no iPad or Android tablet), you have to be connected to the Internet to read. [It seems to be 15% off with the code ILOVEDIGITAL or IKGADIGITAAL.] Again, there are other options but we don't provide a full list here. Do your own research. \n\nDigital Resources for Students: Visit https://media.pearsoncmg.com/ov2/intl/ge/2021/cws/ge_kurose_compnetwork_8/cw/index.php to register and access. If the link does not work for you somehow, just Google “Pearson Global Editions companion website\". To register, use the access code on the page titled “Digital Resources for Students” on your textbook.   \n\n✉ Lecturers & Contact\n\nTanir Ozcelebi\nAssociate Professor\nt.ozcelebi@tue.nl\n\n[Responsible lecturer]\n\nNidhi Srinivasan\nDoctoral Candidate\ns.srinivasan1@tue.nl\n\n[Instruction/Essay]\n\nRichard Verhoeven\nResearcher\np.h.f.m.verhoeven@tue.nl\n\n[Lab]\n\nBram van Berlo \nDoctoral Candidate",
    "url": "homepage",
    "published": true,
    "front_page": true
  }
}